load-test.yml
config:
  target: "http://localhost:3001"
  phases:
    - duration: 30
      arrivalRate: 50
      rampTo: 50
      name: "Ramp up to 50 users"
  ensure:
    - statusCode: 200
scenarios:
  - name: "Get all quotes (unpaginated)"
    weight: 100
    flow:
      - get:
          url: "/api/quotes/unpaginated"
  - name: "Get paginated quotes (page 1, limit 20)"
    weight: 0
    flow:
      - get:
          url: "/api/quotes?page=1&limit=20"
  - name: "Add to favorites"
    weight: 100
    flow:
      - post:
          url: "/api/favorites"
          json:
            quoteId: 1